7767517
99 137
Input in0 0 1 in0
Convolution convrelu_0 1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432 9=1
ConvolutionDepthWise convdwrelu_0 1 1 1 2 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Convolution convrelu_1 1 1 2 3 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256 9=1
ConvolutionDepthWise convdwrelu_1 1 1 3 4 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=144 7=16 9=1
Convolution convrelu_2 1 1 4 5 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=640 9=1
ConvolutionDepthWise convdwrelu_2 1 1 5 6 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=360 7=40 9=1
Convolution convrelu_3 1 1 6 7 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1600 9=1
ConvolutionDepthWise convdwrelu_3 1 1 7 8 0=40 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=360 7=40 9=1
Convolution convrelu_4 1 1 8 9 0=72 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2880 9=1
ConvolutionDepthWise convdwrelu_4 1 1 9 10 0=72 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=648 7=72 9=1
Convolution convrelu_5 1 1 10 11 0=72 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=5184 9=1
ConvolutionDepthWise convdwrelu_5 1 1 11 12 0=72 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=648 7=72 9=1
Convolution convrelu_6 1 1 12 13 0=72 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=5184 9=1
Split splitncnn_0 1 2 13 14 15
ConvolutionDepthWise convdwrelu_6 1 1 15 16 0=72 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=648 7=72 9=1
Convolution convrelu_7 1 1 16 17 0=152 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=10944 9=1
ConvolutionDepthWise convdwrelu_7 1 1 17 18 0=152 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1368 7=152 9=1
Convolution convrelu_8 1 1 18 19 0=152 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=23104 9=1
Split splitncnn_1 1 2 19 20 21
ConvolutionDepthWise convdwrelu_8 1 1 21 22 0=152 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1368 7=152 9=1
Convolution convrelu_9 1 1 22 23 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=43776 9=1
ConvolutionDepthWise convdwrelu_9 1 1 23 24 0=288 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2592 7=288 9=1
Convolution convrelu_10 1 1 24 25 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=82944 9=1
ConvolutionDepthWise convdwrelu_10 1 1 25 26 0=288 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2592 7=288 9=1
Convolution convrelu_11 1 1 26 27 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=82944 9=1
ConvolutionDepthWise convdwrelu_11 1 1 27 28 0=288 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2592 7=288 9=1
Convolution convrelu_12 1 1 28 29 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=82944 9=1
ConvolutionDepthWise convdwrelu_12 1 1 29 30 0=288 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2592 7=288 9=1
Convolution convrelu_13 1 1 30 31 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=82944 9=1
ConvolutionDepthWise convdwrelu_13 1 1 31 32 0=288 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2592 7=288 9=1
Convolution convrelu_14 1 1 32 33 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=82944 9=1
Convolution conv_59 1 1 14 34 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152
Split splitncnn_2 1 3 34 35 36 37
Convolution conv_60 1 1 20 38 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2432
Split splitncnn_3 1 3 38 39 40 41
Convolution conv_61 1 1 33 42 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
Split splitncnn_4 1 2 42 43 44
Interp F.interpolate_72 1 1 43 53 0=2 1=2.0 2=2.0
BinaryOp add_0 2 1 41 53 54 0=0
Split splitncnn_6 1 2 54 55 56
Interp F.interpolate_73 1 1 55 62 0=2 1=2.0 2=2.0
BinaryOp add_1 2 1 37 62 63 0=0
Convolution conv_62 1 1 63 64 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Split splitncnn_7 1 2 64 65 66
Convolution conv_63 1 1 56 67 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Convolution conv_64 1 1 44 68 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Convolution conv_65 1 1 65 69 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2304
BinaryOp add_2 2 1 67 69 70 0=0
Split splitncnn_8 1 2 70 71 72
Convolution conv_66 1 1 72 73 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2304
BinaryOp add_3 2 1 68 73 74 0=0
Convolution conv_67 1 1 71 75 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Convolution conv_68 1 1 74 76 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
ConvolutionDepthWise convdwrelu_14 1 1 66 77 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Convolution convrelu_15 1 1 77 78 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
ConvolutionDepthWise convdwrelu_15 1 1 78 79 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64 9=1
Convolution convrelu_16 1 1 79 80 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Split splitncnn_9 1 3 80 81 82 83
Convolution conv_71 1 1 83 84 0=2 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152
Convolution conv_72 1 1 82 85 0=8 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Convolution conv_73 1 1 81 86 0=20 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=11520
Permute permute_84 1 1 84 87 0=3
Reshape reshape_93 1 1 87 88 0=1 1=-1
Sigmoid sigmoid_41 1 1 88 out0
Permute permute_85 1 1 85 90 0=3
Reshape reshape_94 1 1 90 out3 0=4 1=-1
Permute permute_86 1 1 86 92 0=3
Reshape reshape_95 1 1 92 out6 0=10 1=-1
ConvolutionDepthWise convdwrelu_16 1 1 75 94 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Convolution convrelu_17 1 1 94 95 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
ConvolutionDepthWise convdwrelu_17 1 1 95 96 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64 9=1
Convolution convrelu_18 1 1 96 97 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Split splitncnn_10 1 3 97 98 99 100
Convolution conv_76 1 1 100 101 0=2 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152
Convolution conv_77 1 1 99 102 0=8 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Convolution conv_78 1 1 98 103 0=20 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=11520
Permute permute_87 1 1 101 104 0=3
Reshape reshape_96 1 1 104 105 0=1 1=-1
Sigmoid sigmoid_42 1 1 105 out1
Permute permute_88 1 1 102 107 0=3
Reshape reshape_97 1 1 107 out4 0=4 1=-1
Permute permute_89 1 1 103 109 0=3
Reshape reshape_98 1 1 109 out7 0=10 1=-1
ConvolutionDepthWise convdwrelu_18 1 1 76 111 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16 9=1
Convolution convrelu_19 1 1 111 112 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
ConvolutionDepthWise convdwrelu_19 1 1 112 113 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64 9=1
Convolution convrelu_20 1 1 113 114 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Split splitncnn_11 1 3 114 115 116 117
Convolution conv_81 1 1 117 118 0=2 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152
Convolution conv_82 1 1 116 119 0=8 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Convolution conv_83 1 1 115 120 0=20 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=11520
Permute permute_90 1 1 118 121 0=3
Reshape reshape_99 1 1 121 122 0=1 1=-1
Sigmoid sigmoid_43 1 1 122 out2
Permute permute_91 1 1 119 124 0=3
Reshape reshape_100 1 1 124 out5 0=4 1=-1
Permute permute_92 1 1 120 126 0=3
Reshape reshape_101 1 1 126 out8 0=10 1=-1
